<template>
      <div class="policy_container">
            <h1>Політика конфіденційності</h1>
            <p>Ця Політика конфіденційності персональних даних (далі – Політика конфіденційності) діє стосовно всієї
                  інформації, розташована за адресою - https://spynalife.com/, може отримати про Користувача під час
                  використання нашого сайту, програм та продуктів які ми пропонуємо.</p>
            <h2>1. ВИЗНАЧЕННЯ ТЕРМІНІВ</h2>
            <p>1.1 У цій Політиці конфіденційності використовуються такі терміни:</p>

            <p>1.1.1. «Адміністрація сайту Центру кінезітерапії “SPYNA LIFE” (далі – Адміністрація сайту)» – уповноважені
                  співробітники на управління сайтом, які діють від імені Центру кінезітерапії “SPYNA LIFE”, які організують
                  та
                  здійснють обробку персональних даних, а також визначають цілі обробки персональних даних, склад персональних
                  даних, що підлягають обробці, дії або операції, які здійснюються з персональними даними.</p>

            <p> 1.1.2. «Персональні дані» - будь-яка інформація, що відноситься до прямо чи опосередковано визначеної чи
                  визначеної фізичної особи (суб'єкта персональних даних).</p>

            <p>
                  1.1.3. «Обробка персональних даних» - будь-яка дія (операція) або сукупність дій (операцій), що здійснюються
                  з
                  використанням засобів автоматизації або без використання таких засобів з персональними даними, включаючи
                  збирання,
                  записування, систематизацію, накопичення, зберігання, уточнення (оновлення, зміну), вилучення, використання,
                  передачу (поширення, надання, доступ), знеособлення, блокування, видалення, знищення персональних даних.
            </p>

            <p>
                  1.1.4. «Конфіденційність персональних даних» - обов'язкова для дотримання Адміністратором або іншою особою,
                  яка
                  отримала доступ до персональних даних, вимога не допускати їх розповсюдження без згоди суб'єкта персональних
                  даних
                  або наявності іншої законної підстави.
            </p>

            <p>
                  1.1.5. «Користувач сайту Центру кінезітерапії “SPYNA LIFE”» – особа, яка має доступ до Сайту, за допомогою
                  мережі
                  Інтернет та використовує Сайт https://spynalife.com/
            </p>

            <p>
                  1.1.6. "Cookies" - невеликий фрагмент даних, надісланий веб-сервером і зберігається на комп'ютері
                  користувача,
                  який веб-клієнт або веб-браузер щоразу пересилає веб-серверу в HTTP-запиті при спробі відкрити сторінку
                  відповідного сайту.
            </p>

            <p>
                  1.1.7. IP-адреса — унікальна мережна адреса вузла в комп'ютерній мережі, побудованій за протоколом IP.
            </p>

            <h2>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h2>

            <p>
                  2.1. Використання Користувачем сайту https://spynalife.com/ означає згоду з цією Політикою конфіденційності
                  та
                  умовами обробки персональних даних Користувача.
            </p>

            <p>
                  2.2. У разі незгоди з умовами Політики конфіденційності, Користувач повинен припинити використання сайту
                  Центра
                  кінезітерапії “SPYNA LIFE”
            </p>

            <p>
                  2.3. Ця Політика конфіденційності застосовується тільки до сайту https://spynalife.com/. Центр кінезітерапії
                  “SPYNA LIFE” не контролює та не несе відповідальності за сайти третіх осіб, на які Користувач може перейти
                  за
                  посиланнями, доступними на сайті https://spynalife.com/.
            </p>

            <p>
                  2.4. Адміністрація сайту не перевіряє достовірність персональних даних, які надає Користувач сайту Центра
                  кінезітерапії “SPYNA LIFE”.
            </p>

            <h2>3. ПРЕДМЕТ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h2>

            <p>
                  3.1. Ця Політика конфіденційності встановлює зобов'язання Адміністрації сайту щодо нерозголошення та
                  забезпечення
                  режиму захисту конфіденційності персональних даних, які Користувач надає на запит Адміністрації сайту при
                  реєстрації на сайті.
            </p>

            <p>
                  3.2. Персональні дані, дозволені для обробки в рамках цієї Політики конфіденційності, надаються Користувачем
                  шляхом заповнення реєстраційної форми на Сайті в формах для реєстрації та включають наступну інформацію:
            </p>

            <p>
                  3.2.1. ПІБ Користувача;
            </p>

            <p>
                  3.2.2. контактний телефон Користувача;
            </p>

            <p>
                  3.2.3. адресу електронної пошти (e-mail);
            </p>

            <p>
                  3.3. Центр кінезітерапії “SPYNA LIFE” захищає Дані, що автоматично передаються в процесі перегляду рекламних
                  блоків та при відвідуванні сторінок, на яких встановлено статистичний скрипт системи ("піксель"):
            </p>

            <p>
                  IP-адреса;
                  інформація з cookies;
                  інформація про браузер (або іншу програму, яка здійснює доступ до показу реклами);
                  час доступу;
                  адресу сторінки, де розташований рекламний блок;
                  реферер (адреса попередньої сторінки).
            </p>

            <p>
                  3.3.1. Відключення cookies може спричинити неможливість доступу до частин сайту, які потребують авторизації.
            </p>

            <p>
                  3.3.2. Центр кінезітерапії “SPYNA LIFE” здійснює збір статистики про IP-адреси своїх відвідувачів. Дана
                  інформація
                  використовується з метою виявлення та вирішення технічних проблем, для контролю законності фінансових
                  платежів, що
                  проводяться.
            </p>

            <p>
                  3.4. Будь-яка інша персональна інформація, не обумовлена ​​вище (історія покупок, використовувані браузери
                  та
                  операційні системи тощо), підлягає надійному зберіганню та нерозповсюдженню, за винятком випадків,
                  передбачених у
                  п.п. 5.2. та 5.3. цієї Політики конфіденційності.
            </p>

            <h2>4. ЦІЛІ ЗБОРУ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ КОРИСТУВАЧА</h2>

            <p>
                  4.1. Персональні дані Користувача Адміністрація сайту може використовуватись з метою:
            </p>

            <p>
                  4.1.1. Ідентифікації Користувача, зареєстрованого на сайті, для оформлення замовлення та (або) укладання
                  Договору
                  купівлі-продажу товару/послуги дистанційним способом із сайту.
            </p>

            <p>
                  4.1.2. Надання Користувачеві доступу до персоналізованих ресурсів Сайту.
            </p>

            <p>
                  4.1.3. Встановлення з Користувачем зворотного зв'язку, включаючи направлення повідомлень, запитів щодо
                  використання Сайту, надання послуг, обробка запитів та заявок від Користувача.
            </p>

            <p>
                  4.1.4. Визначення місця знаходження Користувача для забезпечення безпеки, запобігання шахрайству.
            </p>

            <p>
                  4.1.5. Підтвердження достовірності та повноти персональних даних, наданих Користувачем.
            </p>

            <p>
                  4.1.6. Створення облікового запису для здійснення покупок, якщо Користувач погодився на створення облікового
                  запису.
            </p>

            <p>
                  4.1.7. Повідомлення Користувача Сайту про стан заявки\ бронювання сеансу масажу.
            </p>

            <p>
                  4.1.8. Оброблення та отримання платежів, підтвердження податку чи податкових пільг Користувачем.
            </p>

            <p>
                  4.1.9. Надання Користувачеві ефективної клієнтської та технічної підтримки у разі виникнення проблем,
                  пов'язаних з
                  використанням Сайту.
            </p>

            <p>
                  4.1.10. Надання Користувачеві з його згоди, оновлень продукції, спеціальних пропозицій, інформації про ціни,
                  розсилки новин та інших відомостей від імені Центр кінезітерапії “SPYNA LIFE”.
            </p>

            <p>
                  4.1.11. Здійснення рекламної діяльності за згодою Користувача.
            </p>

            <p>
                  4.1.12. Надання доступу Користувачеві на сайти або сервісів партнерів у з метою отримання продуктів,
                  оновлень та
                  послуг.
            </p>

            <h2>5. СПОСОБИ ТА ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ</h2>

            <p>
                  5.1. Обробка персональних даних Користувача здійснюється без обмеження терміну будь-яким законним способом,
                  у тому
                  числі в інформаційних системах персональних даних з використанням засобів автоматизації або без використання
                  таких
                  засобів.
            </p>

            <p>
                  5.2. Користувач погоджується з тим, що Адміністрація сайту має право передавати персональні дані третім
                  особам,
                  зокрема кур'єрським службам, організаціям поштового зв'язку, операторам електрозв'язку, виключно з метою
                  виконання
                  замовлення Користувача.
            </p>

            <p>
                  5.3. Персональні дані Користувача можуть бути передані уповноваженим органам державної влади України лише на
                  підставах та в порядку, встановлених законодавством України.
            </p>

            <p>
                  5.4. У разі втрати або розголошення персональних даних Адміністрація сайту інформує Користувача про втрату
                  або
                  розголошення персональних даних.
            </p>

            <p>
                  5.5. Адміністрація сайту вживає необхідних організаційних та технічних заходів для захисту персональної
                  інформації
                  Користувача від неправомірного або випадкового доступу, знищення, зміни, блокування, копіювання,
                  розповсюдження, а
                  також від інших неправомірних дій третіх осіб.
            </p>

            <p>
                  5.6. Адміністрація сайту спільно з Користувачем вживає всіх необхідних заходів щодо запобігання збиткам або
                  іншим
                  негативним наслідкам, спричиненим втратою або розголошенням персональних даних Користувача.
            </p>

            <h2>6. ОБОВ'ЯЗКИ СТОРІН</h2>

            <p>
                  6.1. Користувач зобов'язаний:
            </p>

            <p>
                  6.1.1. Надати інформацію про персональні дані, необхідну для користування Сайтом.
            </p>

            <p>
                  6.1.2. Оновити, доповнити надану інформацію про персональні дані у разі зміни даної інформації.
            </p>

            <p>
                  6.2. Адміністрація сайту зобов'язана:
            </p>

            <p>
                  6.2.1. Використовувати отриману інформацію виключно для цілей, зазначених у п. 4 цієї Політики
                  конфіденційності.
            </p>

            <p>
                  6.2.2. Забезпечити зберігання конфіденційної інформації в таємниці, не розголошувати без попереднього
                  письмового
                  дозволу Користувача, а також не здійснювати продаж, обмін, опублікування або розголошення іншими можливими
                  способами переданих персональних даних Користувача, за винятком пп. 5.2. та 5.3. цієї Політики
                  Конфіденційності.
            </p>

            <p>
                  6.2.3. Вживати запобіжних заходів для захисту конфіденційності персональних даних Користувача згідно з
                  порядком,
                  який зазвичай використовується для захисту такого роду інформації в існуючому діловому обороті.
            </p>

            <p>
                  6.2.4. Здійснити блокування персональних даних, що належать до відповідного Користувача, з моменту звернення
                  або
                  запиту Користувача або його законного представника або уповноваженого органу захисту прав суб'єктів
                  персональних
                  даних на період перевірки у разі виявлення недостовірних персональних даних або неправомірних дій.
            </p>

            <h2>7. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2>

            <p>
                  7.1. Адміністрація сайту, яка не виконала своїх зобов'язань, несе відповідальність за збитки, зазнані
                  Користувачем
                  у зв'язку з неправомірним використанням персональних даних відповідно до законодавства України, за винятком
                  випадків, передбачених п.п. 5.2., 5.3. та 7.2. цієї Політики Конфіденційності.
            </p>

            <p>
                  7.2. У разі втрати або розголошення Конфіденційної інформації Адміністрація сайту не несе відповідальності,
                  якщо
                  ця конфіденційна інформація:
            </p>

            <p>
                  7.2.1. Стала громадським надбанням до її втрати чи розголошення.
            </p>

            <p>
                  7.2.2. Була отримана від третьої сторони до її отримання Адміністрацією сайту.
            </p>

            <p>
                  7.2.3. Була розголошена за згодою Користувача.
            </p>

            <h2>8. Вирішення суперечок</h2>

            <p>
                  8.1. До звернення до суду з позовом щодо спорів, що виникають із відносин між Користувачем сайту Центру
                  кінезітерапії “SPYNA LIFE” та Адміністрацією сайту, обов'язковим є пред'явлення претензії (письмової
                  пропозиції
                  щодо добровільного врегулювання спору).
            </p>

            <p>
                  8.2 Одержувач претензії протягом 30 календарних днів з дня отримання претензії письмово повідомляє заявника
                  претензії про результати розгляду претензії.
            </p>

            <p>
                  8.3. При недосягненні угоди спір буде передано на розгляд до судового органу відповідно до чинного
                  законодавства
                  України.
            </p>

            <p>
                  8.4. До цієї Політики конфіденційності та відносин між Користувачем та Адміністрацією сайту застосовується
                  чинне
                  законодавство України.

            </p>

            <h2>9. ДОДАТКОВІ УМОВИ</h2>

            <p>
                  9.1. Адміністрація сайту має право вносити зміни до цієї Політики конфіденційності без згоди Користувача.
            </p>

            <p>
                  9.2. Нова Політика конфіденційності набирає чинності з моменту її розміщення на Сайті школи масажу, якщо
                  інше не
                  передбачено новою редакцією Політики конфіденційності.
            </p>

            <p>
                  9.3. Усі пропозиції або питання щодо цієї Політики конфіденційності слід повідомляти в розділ "КОНТАКТИ".
            </p>

            <p>
                  9.4. Чинна Політика конфіденційності розміщена на сторінці за адресою
                  "https://spynalife.com/privacy-policy".
            </p>


      </div>
</template>


<script>
export default {
      name: 'PolicyView',
}

</script>

<style lang="scss">
@import url("../assets/modules/_fonts.scss");

@mixin text_style ($f-f, $f-s, $l-h, $f-w, $coloring) {
      font-family: $f-f;
      font-size: $f-s;
      line-height: $l-h;
      font-weight: $f-w;
      color: $coloring;
}

.policy_container {
      padding: 100px 190px 100px 190px;
      @include text_style ('Montserrat', 24px, 40px, 400, #000);

      width: 80%;
      margin: 0 auto;

      p {
            margin-bottom: 20px;
      }

      h1 {
            @include text_style ('Montserrat', 33px, 35px, 700, #3341dcd8);
            text-transform: uppercase;
            margin: 40px auto 60px;
            text-align: center;
            position: relative;
            max-width: 590px;

            &::after {
                  content: ' ';
                  position: absolute;
                  border: 2px solid #3341dcd8;
                  width: 100%;
                  bottom: -20px;
                  left: 0;
            }
      }

      h2 {
            @include text_style ('Montserrat', 28px, 35px, 700, #000);
            margin: 40px 0;

            text-transform: uppercase;
      }
}

@media screen and (max-width: 1415px) {
      .policy_container {
            width: 90%;
      }
}

@media screen and (max-width: 1200px) {
      .policy_container {
            width: 100%;
            padding: 100px 90px 100px 90px;
      }
}

@media screen and (max-width: 1024px) {
      .policy_container {
            padding: 80px 90px 100px 90px;
            @include text_style ('Montserrat', 20px, 30px, 400, #000);

            h1 {
                  @include text_style ('Montserrat', 25px, 30px, 700, #3341dcd8);
                  max-width: 490px;
            }

            h2 {
                  @include text_style ('Montserrat', 23px, 30px, 700, #000);
            }
      }
}

@media screen and (max-width: 724px) {
      .policy_container {
            padding: 80px 40px 60px 40px;
      }
}

@media screen and (max-width: 400px) {
      .policy_container {
            @include text_style ('Montserrat', 18px, 30px, 400, #000);

            h1 {
                  @include text_style ('Montserrat', 18px, 30px, 700, #3341dcd8);
                  max-width: 490px;
            }

            h2 {
                  @include text_style ('Montserrat', 18px, 30px, 700, #000);
            }
      }
}
</style>